{"review_id":"NxL8SIC5yqOdnlXCg18IBg","user_id":"KpkOkG6RIf4Ra25Lhhxf1A","business_id":"2aFiy99vNLklCx3T_tGS9A","stars":5,"date":"2011-10-10","text":"If you enjoy service by someone who is as competent as he is personable, I would recommend Corey Kaplan highly. The time he has spent here has been very productive and working with him educational and enjoyable. I hope not to need him again (though this is highly unlikely) but knowing he is there if I do is very nice. By the way, I'm not from El Centro, CA. but Scottsdale, AZ.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"pXbbIgOXvLuTi_SPs1hQEQ","user_id":"bQ7fQq1otn9hKX-gXRsrgA","business_id":"2aFiy99vNLklCx3T_tGS9A","stars":5,"date":"2010-12-29","text":"After being on the phone with Verizon Wireless trying to figure out why my phone wasn't working for 4.5 hours, I was put in touch with Sharpie Tech. Well, after 10 seconds they fixed the problem. As the owner of a company that does our best numbers over the holiday season, having my phone out of order for 4.5 hours was horrible. Sharpie Tech fixed the problem in record time, even Verizon was shocked. I highly recommend working with this company and I look forward to working with them more. \n\n-Rachel Charlupski\nFounder and CEO, The Babysitting Company","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"wslW2Lu4NYylb1jEapAGsw","user_id":"r1NUhdNmL6yU9Bn-Yx6FTw","business_id":"2aFiy99vNLklCx3T_tGS9A","stars":5,"date":"2011-04-29","text":"Great service! Corey is very service oriented. Works fast and very effiecient with his time. Going to use him again real soon to do additional IT services. thanks Corey.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"GP6YEearUWrzPtQYSF1vVg","user_id":"aW3ix1KNZAvoM8q-WghA3Q","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-07-14","text":"Highly recommended. Went in yesterday looking for a dresser to use as a tv stand. Found the perfect piece for the retro look I'm going for. I found some other small decor items. Price was fair and they delivered today.  Shawn did a great job. Keep up the good work! I will definitely be back.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"25RlYGq2s5qShi-pn3ufVA","user_id":"YOo-Cip8HqvKp_p9nEGphw","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":4,"date":"2014-01-15","text":"I walked in here looking for a specific piece of furniture.  I didn't find it, but what I did find were so many things that I didn't even know I needed!  So much cool stuff here, go check it out!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"Uf1Ki1yyH_JDKhLvn2e4FQ","user_id":"bgl3j8yJcRO-00NkUYsXGQ","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2013-04-28","text":"What a great place! Modern on Melrose has amazing furniture at great prices. I highly recommend and will be back when I am looking for new pieces.","useful":2,"funny":0,"cool":1,"type":"review"}
{"review_id":"oFmVZh-La7SuvpHrH_Al4Q","user_id":"CWKF9de-nskLYEqDDCfubg","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":4,"date":"2014-10-12","text":"A hidden gem! Found a beautiful buffet for a great price. Whether you're looking for new or something to refurbish, this place is def worth the look!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"bRvdVt88MJ_YMTlLbjDLxQ","user_id":"GJ7PTY7huYORFKKg3db3Gw","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2012-09-18","text":"This place is a great for those vintage\/mid century modern finds. From clothing to couches they have it all and great prices too.  They have similar items to their neighbors Modern Manor, but not the \"designer\" prices.  We got a green vintage chair for $98 and just are having the skirt around the bottom removed to show the great legs on it.  We will always check back at Melrose when looking for unique pieces for our home.","useful":2,"funny":0,"cool":0,"type":"review"}
{"review_id":"zNUSxqflZKgKD1NQH3jdFA","user_id":"rxqp9eXZj1jYTn0UIsm3Hg","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2015-10-11","text":"This is the place to go for all your Mid Century finds.\nWe live in Oro Valley and it is not too far to travel when we need a specific item.\nI called yesterday asking if they has something we need and minutes later I was text numerous pictures.  Because of the excellent staff, I will be going up there today.\nOne of my number one places to go when I go to Phoenix.\nPrices are very fair for these past treasures.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"LkP1l7sZIwOV6IKNLqQp_A","user_id":"UU0nHQtHPMAfLidk8tOHTg","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2015-04-05","text":"Great items at a good price.  Helpful, easy to deal with owners.  Just the sort of place you LIKE spending  your dollars at...and they have furniture, etc. that you don't see elsewhere.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"MvvT0BtQH9wq7K-pPgkoEQ","user_id":"A_Hyfk3FcwFVIk1CQC7z7w","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":1,"date":"2014-07-08","text":"Disappointing.  I've been there twice hoping that a re-return would change my original opinion.  The first time I was there was on a Saturday, early afternoon in Spring.  I found it strange that I was the only one in the store for about 20 minutes, until another customer came in.  Melrose is usually a pretty happening place during the Spring before summer temps hit.  I saw a lot of nice 1960s furniture, mostly living room sets and home decor.  Prices were on the high end for, let's face it folks, used furniture. The blonde lady who came out to greet me after I made it to their second room (there are 3 rooms total) was frazzled and preoccupied with eating her lunch. So I went back again last week.  Didn't see the frazzled lady from before but a mid-age hipster guy at the counter who didn't have the time to greet me (sorry I disrupted your cell phone surfing).  Yep.  I was the ONLY person in the store and you obviously ignored me.  \n\nIt's just an unwelcoming place.  So much potential, but the attitude there is less than acceptable.  Will spend my $$$ elsewhere.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"dJguzIfNKtGkKk8ryOPdfQ","user_id":"OvD92wp0-uuFoGLBymwfKQ","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-08-23","text":"I'm a local Real Estate agent and have fallen in love with all of the AMAZZZZZING Mid-Century Modern properties that the Phoenix and Tempe area have to offer. After listing and selling a few of these COOL homes I decided that I should be more familiar with a few MCM furniture shops that I could buy or lease a higher quality furniture. \n\nAfter going in a bunch of places I can say that I really love this store and cant wait to use them to stage my newest listing in a few months at 24th and Indian School.\n\nLet me know if you need help finding a cool house with character to put your amazing finds from Modern on Melrose.\n\nEnjoy\n\nSteven\n480-370-5570\nstevenonmill@gmail.com","useful":1,"funny":1,"cool":1,"type":"review"}
{"review_id":"l-yhe0IFJ7WTgEk0qD8yqA","user_id":"5NDk-q5mv8PIDvz83HwMVg","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":4,"date":"2015-01-13","text":"Modern on Melrose is one of our favorite shops on La Curva. It is on the pricey side (of an already pricey shopping experience) but I've had great success for two reasons:\n\nFirst, the service has been excellent and friendly. We're new to the mcm scene and didn't get snubbed at for not being \"in the know\" -- sadly, this was a welcome relief. \n\nSecond, the selection is good. Yeah, it's always a hunt, but at MOM you aren't going to be sifting through, basically, garbage to find your treasures. With most of the weeding done for you, the store is a much nicer visit.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"cNA3oGTmmeRvt10vrvlJOQ","user_id":"AziQIgYIAY6uVw1k8sbtTw","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-08-05","text":"Walked into the store and stuck up a conversation with Shawn behind the counter. We talked about some furniture and other ideas I had for the home. I told him I needed a custom made shelf. Shawn asked some questions and then he sketched out a concept. I loved it. He then said Modern on Melrose has a man that does custom metal work. Three days later-it was done and it turned out better than I could have ever imagined.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"S_Z5aqlpTVkR9RmYvcPpTQ","user_id":"A65IYKs3FwsyyJH20XOk2w","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-12-22","text":"What a lovely place. My boyfriend and I went along with my parents (who love mid century modern furniture) just to look as I am moving soon and can't buy any furniture until I relocate, but this shop made me want to move to downtown Phoenix and fill my house with everything in this shop. My thrift-genius parents taught me to buy antique furniture and never ever ever buy new, as new furniture is expensive to buy and cheaply made. Modern on Melrose is fantastic proof of this - my boyfriend fell in love with a yellow leather and wood 70s couch and noticed that this beautiful couch cost less than a couch our friend recently bought at IKEA. And no one is going to buy IKEA couches in antique stores 40 years from now, because they barely last 1 move. \n\nEverything in this store is gorgeous and there is a great variety of furniture and random decor goods. We ended up buying some great stacking canisters as a gift, and the very helpful employee dashed back to the area we got them and told us they were 40% off. We debated keeping the canisters because they were as affordable as they were quirky and useful and interestingly designed, but the Christmas spirit prevailed and we decided to give them to their original recipient.\n\nThe same employee discussed style and furniture things with my father in a very helpful and absolutely non pretentious way, which is a refreshing and fun element of any antique store. I always want to talk to the employees but very often feel they are too busy or want to sound smarter than me (which they are, but I'm not buying anything if the person I'm giving money to makes me feel stupid). I was very struck by how open and helpful the employee was. Great experience. Great selection. Great prices.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"klVqdjXPM2aM8Y0RsDCPoA","user_id":"wnzfuir72IZFg5RAPOwWCQ","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":1,"date":"2013-11-17","text":"Unfortunately, Yelp does not allow negative stars. I was very much looking forward to going to Modern on Melrose as my sister had raved about the selection and several purchases she recently made here. I was all set to help her select more furniture for her new home until I experienced a combination of disbelief, shock and horror. \n\nI was inside the store when I heard a man loudly say \"If you're going to start a sale, finish it!\" It took a few more seconds of loud voices before I realized an argument was taking place between two employees and not two customers, as I initially thought. The male and female employee continued to loudly argue, back and forth. Feeling very uncomfortable, I started to look for my sister. There were about four other customers and we all ended up outside as we all felt very uncomfortable in the store. \n\nAs I was walking out of the store to go out back, I heard the male employee say, in a tone that was beyond anger but instead violent, \"Don't you ever tell me to shut up! Ever!\" Shortly after, he walked past all 5 female customers, who had gathered out back, turned to us and angrily said \"Bitch!\" Not knowing what he was going to do when he returned, we decided to leave as we did not feel safe. \n\nIt is one thing to feel uncomfortable, it is completely unacceptable to not feel safe. The interaction between the two employees was the most unprofessional thing I have ever witnessed. The male and female employee were so caught up in their own negative interaction, neither of them offered any customer service. And after their argument ended, the female employee offered no apologies and still no customer service. \n\nToday was my first and last time in Modern on Melrose. How terribly sad for this store. I sincerely hope the owners get a handle on this and educate their employees as to what it and isn't acceptable behavior.","useful":4,"funny":3,"cool":2,"type":"review"}
{"review_id":"Lulhm9mWWcgndcuc_zsgPA","user_id":"2N9wrn5A37aOXDrBPIYQdA","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":4,"date":"2013-07-10","text":"Favorite vintage store I have been in. I have been going to a lot lately looking for midcentury furniture that won't empty out my bank account. Happened to drive by this place and decided to take a look. I got a 3 piece coffee table and side tables set for 60 bucks. Can't beat that. The lady working I completely loved! She was helpful and let me know what kind of stuff will be coming in. This will be a weekly stop for me. \nIf you are looking for awesome vintage furniture in good shape this is the place to go. They know their stuff. A lot of awesome lamps and boomerang coffee tables. It is a must visit.\n\nupdate: seems like items are getting higher and higher. style has changed a bit. still nice stuff if you wanna empty your bank account. no longer a weekly stop but i will still  stop by.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"k4xighfFxKv5H-Eic28MNQ","user_id":"oKZiDLm0D1PIm1-vRtvONA","business_id":"2LfIuF3_sX6uwe-IR-P0jQ","stars":5,"date":"2014-08-23","text":"I stumbled upon Modern on Melrose earlier in the week in my search for bedroom furniture. I had been a a few other shops but nothing caught my eye. When I walked in I knew immediately that I was in the right place.\n\nThe store is very well curated unlike many other vintage\/antique shops. I spent a few minutes looking around (I don't like to be bothered right away when I come in to a store). Cynthia greeted me warmly and I asked her to help me pick out some bedroom furniture. She asked me about my style preferences and showed me around. She noted what I liked and didn't like and made informed recommendations. It took me all of ten minutes to pick out the furniture I wanted. Cynthia actually asked me if I wanted to take some time to consider my purchase (not pushy at all!) and I told her I loved everything and I wanted to take delivery as soon as possible.\n\nI then asked Cynthia to help me find a pair of lamps for the bed side tables I purchased. This time around I wasn't really loving anything but she took the time again to show me around and listen to my input. \n\nAnother reviewer mentioned that their pieces are pricy and that could not be further from the truth. I had found some lower end shops that did not have the quality I was looking for and I also found some very high end shops. Modern on Melrose has excellent prices and the quality to back it up. I was pleasantly surprised by the value they provide.\n\nI was able to have my furniture delivered the next day and I'm loving my new (old) furniture. I highly recommend you check them out!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"U617X1icAyAC5hbjsnhcpA","user_id":"XMRkVYpQAZpWOpia5-MoPw","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":1,"date":"2010-02-16","text":"Overall, I'll never go back. Rewinding to the reason of my conclusion: messy racks, bad choice on jewelry, no focus on fits whatsoever, no pricing consistency, and paint-scraping help from the hired help (owner of Red). I felt like I was bothering someone instead of shopping. \n\nI recommend Retro Ranch, Fashion by Robert Black, France's or the new Vintage shop next to Hula's and Lola Coffee on Central Ave.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"_a7Zu2ZSEGO4bl2gvu7OtQ","user_id":"jhhHm3Vk9ZlP21WdY_5R0w","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":5,"date":"2009-04-10","text":"I love Mint, and even though I'm a guy and there isn't much for me there, it's a great place for gifts for the lucky gals in my life.  It's definitely worth checking out, despite what the other reviewers have said so far.","useful":2,"funny":2,"cool":1,"type":"review"}
{"review_id":"5hU8Uxdem1j_PEr4HFs5HQ","user_id":"9Cmmt_34PxuC84P1AgmetQ","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":5,"date":"2009-01-30","text":"I read the reviewer before me and checked things out for myself.  I don't know about the size 0-4 comment because I found 3 dresses all over size 8 and some great necklaces all very reasonably priced.  Rumor has it the day to go is Sunday or Monday, which is when more things are added to the inventory.  I also left my name and email because I was looking for a vintage Chanel bag and I got an email when they got one.  I can't afford to shop on the furniture side of the store but I've found a lot of great funky things at mint.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"RAzbLYbgw3tNv8Tu0R7qmQ","user_id":"B7ecAeAIrXg7sgmabS38pg","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":3,"date":"2007-12-15","text":"Hmmm, what to say about Mint.\n\nOkay, if you are a girl and looking for clothes here, I'd say pass. Unless of course you have a tiny waste and are maybe a size 0-4 on a good day. If you are looking for funky earrings, it might be worth a stop, but the majority of their earring inventory was kinda weird and a little too 80's inspired for my retro taste. If you are looking for stellar quality (and priced accordingly) funky retro furniture, then definitely pop in here as their selection is really cool and there were a ton of pieces that I easily would have purchased. As for the rest, I'd say hit this store up every once in again and see what they have to offer and if they start carrying bigger sizes in dresses, lemme know :)","useful":5,"funny":5,"cool":4,"type":"review"}
{"review_id":"0-emituHrxFvtYJZVhr2tA","user_id":"mdVHZbSl97wUUoE6hdxeLg","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":3,"date":"2009-09-07","text":"I like this Vintage\/New shop.  I think they need to do something about getting new (vintage) items in more frequently there are things still there from visiting almost a year ago.  Overall I have bought some great finds there and will most definately go back.","useful":3,"funny":1,"cool":2,"type":"review"}
{"review_id":"dfL5TyVib8uZgxaNMwx7Aw","user_id":"je5k8a3qIOM0VJE5MaxsfQ","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":2,"date":"2009-02-01","text":"I remember really enjoying browsing through Mint (and their furniture friends Red) before, I love mid-century Modern (but what casually reading Dwell but highlighting Ikea pseudo-art bitch DOESN'T?) , I like interesting jewelry, I think the space is really intense, like I am in a dream of some sort.\n\nBut I went recently...and I just didn't like it. Sure, these are collectible pieces, goregous condition, the space is well cared for, I don't expect to afford these museum worthy pieces, especially at 11grand for a chair and ottoman (oh god, I hope the ottoman was included in that price....), but the affordable pieces of bracelets, earrings, clothing...um, it was a lot of the same items I saw here over a year ago...actually more like TWO years ago.....so, the inventory isn't very turnovering or fresh...so I guess Mint isn't so fresh?\n\nOverall, I was underwhelmed, I didn't feel particularly welcomed either time I was here, and the stock continues to center on polyster 70s clothing and BCBG tops (?) making an uneven style feel and chilly ambiance.  \n\nDefinitely not worth a stop.","useful":3,"funny":4,"cool":1,"type":"review"}
{"review_id":"z5OD5c-nu2v1xwfG0mAIiA","user_id":"TryfbZaaGtedncOMq9k86g","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":4,"date":"2007-03-04","text":"The vintage 1930 beaded earrings are still calling to me.  I can hear them.  Knowing I saw similar ones being sold for $15 at Cost Plus vs the $60 for the vintage ones helps a little - but not much.  \n\nVery cute vintage accessories and clothing.  I almost teared up seeing a super cool crinoline like the one I had in high school.  (Yea, sometimes I was that girl.  We're moving on...)  Really great stuff.  A bit high priced, but not when you consider it's quality. Everything they had was great.  It didn't feel like estate sale shopping, ya know?\n\nThen there's the other 1\/2 of the store that is an art gallery.  Somehow it just works.  Here the prices were extremely reasonable.  Some really great stuff too.  \n\nIt's behind much of the Roosevelt Row stops, just a bit behind Holgas.  Cool, yet approachable.","useful":2,"funny":1,"cool":0,"type":"review"}
{"review_id":"fA2NFb69SvDCsB7WSpY2rw","user_id":"yt1VnahG-MRgU6tswWaUxA","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":2,"date":"2010-03-01","text":"Well.. Well...well..Ive been highly recomended to check this place out, now that I had a chance to see what the hype was all about. I can see for myself that they had very cool pieces of funiture and retroesque clothes. Very impressed up until I asked for some help and questions, and thats were the place lost its apeal. I was quickly imformed that they delt with very high end resorts and hotels, and as for myself adding these pieces in my store would not be a good idea.I think coming in would be a great experiece for someone to see bad service at its finest.","useful":2,"funny":0,"cool":0,"type":"review"}
{"review_id":"OiB7X9UxftB0WAWgd2KdJQ","user_id":"wJ0mbYw5WoiaKxiNEayZvg","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":3,"date":"2010-05-14","text":"Red's merchandise is amazing. Mint's left a little to be desired...ok alot to be desired. Alright, cranky service be damned (now this is a store within a store. it is all the same service for both. it is  just that Red's merchandise is so untouchable (literally even! \"do not sit\" signs abound) that you almost feel like you deserve the treatment because your lusting after, yet can not afford their wares)..... I have ventored into this spot appx twice a year since it has opened. Why am I still starring at the same clothing? I know my sticky fingers have not picked up a frock I could not live without but then I figured it was because I am  both cheap and picky. A hard to please combo. Seriously though, I have been starring at the same stuff for years now. Boring.","useful":1,"funny":1,"cool":1,"type":"review"}
{"review_id":"ezuT8BpvhLITCfbQEWddsw","user_id":"29rUYREQxeFE6LWGnirgew","business_id":"0czfEgv9KAD4VlIa7ANPWQ","stars":2,"date":"2011-01-14","text":"I have been consistently underwhelmed by this place since I moved to the hood a year ago. With so many great vintage spots and local boutiques so close why should anyone make the stop at this over priced and under-friendly place? Your lucky if you get so much as a \"Hi!\" here. The vintage clothes are so so and I have been looking at some of the same ones for over a year now. Go to the 7th avenue shops if you want a fun and friendly vintage experience.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"IXQgVQJUQoJ6sKxV7-cREQ","user_id":"zOU38EUHgUtEI4ziZ8DB1w","business_id":"7GI_V9oLCUGdn2ogqB0IBg","stars":5,"date":"2011-10-19","text":"I highly doubt anyone uses Yelp to find a place like this, but figured I'd write them a review because WSP rocks!\n\nAnyone in the Phoenix area with a need for any type of specialty fuel...look no further.  Personally I use them to purchase methanol for a water\/meth injection kit I have in my car, and their prices are literally the lowest I've seen in the country for methanol.  Paid $3.49\/gal today.  In addition to methanol, they sell every type of fuel, oil, lubricant you can imagine.  Race fuel, AvGas, E85.....etc\n\nAnd different from lots of other industrial-type places, everyone that works here is incredibly helpful and nice.","useful":1,"funny":1,"cool":0,"type":"review"}
{"review_id":"ojtDaz6oAxS74VnAAjb4NQ","user_id":"hMZ3_yBErMi-pFcquyLJWg","business_id":"7GI_V9oLCUGdn2ogqB0IBg","stars":5,"date":"2014-04-26","text":"This place is great!  I first came here to fuel up my old Mercedes on B99.  Even though I live in East Mesa, I would attempt to get there as often as possible, as they are the only place in the valley that will pump B99.  The staff is always friendly and helpful.  The only complaint I have is that their hours make it difficult for me to get fuel.  I understand this, however, as most of their business is from bulk specialty fuel sales, not B99 fill ups.  In response to Sara U, you really have nothing to worry about for getting 5 gallons of E85.  Your car is already running on 5-10% ethanol every time you fill up with unleaded.  I wouldn't do it on a regular basis, but it is not like you put diesel in a gas vehicle or vise versa.   Just fill up with regular unleaded, then have somebody clear your check engine light for you.  It will probably throw a code about the O2 sensor, not because it is broken, but because the oxygen content of the E85 is higher.  It shouldn't come back on.  And no, I don't work there.  I'm just a scientist who knows a thing or two about fuel!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"-6wjE08Pf8oWrZQQocEgHg","user_id":"9sdni8QHrai8l7ikHsV5Jg","business_id":"7GI_V9oLCUGdn2ogqB0IBg","stars":1,"date":"2014-04-23","text":"Dave S can kiss my heini .. I called them to ask if they fuel up regular unleaded gas before going down there and they said yes. They need to inform their customers correctly and label their tanks in addition so it's obvious what they are actually putting into your vehicle. By the way Dave, they put UNLEADED REGULAR fuel (not biofuel) in my tank to dilute the E85 (duh) after they realized they made the mistake. My service engine light has now come on thanks to these idiots.\n\nYou obviously work there Dave. Get your facts right.","useful":0,"funny":1,"cool":0,"type":"review"}
{"review_id":"6-hKBi-6RC3g7Mft0c-6qw","user_id":"PmgqNO0-5Y3e3UoR61TD7w","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2014-03-29","text":"This place is a area staple! Been around for years and not much has changed - I see this as a good thing! Stable and reliable!\n\nMy family goes every year for St. Pattys Day corn beef! Very nice place for a bar night dinner, or to catch up with some friends over drinks!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"tRd0-mPa9O1TMJp_dw5khQ","user_id":"kXUySHSlRgVrcR4Aa0HtGQ","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2014-08-14","text":"Got my mojo back after having a few of their appetite teasers. Love LPW for a no-frills bite to eat.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"8Mu56iQ-MYEyivqUVss0XA","user_id":"SYKPwRhnlKrW6yTvm7oPWg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2012-10-20","text":"Don't go here for the decor, but the staff is friendly and the fried pickles are very tasty.  Good value.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"ToC77cIEiMas9CPU7dt_fA","user_id":"7LCG3o2KW2jgKgbKN0DQOg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":5,"date":"2012-08-25","text":"I believe in awarding stars bearing in mind the type of restaurant reviewed. \n\nOne can tell by the name that LPW won't replace Ohio's lost Maisonette restaurant in Cincy any time soon, nor does it aspire to do so, but for a sports-bar type venue, these folks do it all right, and do so at the right price!\nStopped for lunch on a Saturday.\n\nThe lady got a cheeseburger and fries, I got scrod and broccoli, we split an order of their fried pickles as an app.\nThe pickles were dill spears coated with just the right amount of what was likely a beer batter and deep fried to tangy perfection.\nThey got the spears vs. chips decision right!\n\nThe lady usually looks askew at this type of fare, but happily camped out over the plate and ate her fair share! \n \nAnd here's the kicker they were under four bucks! \n\nKudos Mr. Pickle; you done good!\n\nThe fries were very lightly battered and done perfectly, with just the right amount of crispness outside followed by a creamy interior, ... the fry guy here knows his craft!\nAnd the burger was good as well.. ...typical of the genre.  \n\nI find it difficult to fawn excessively over  a burger.\n\nThe scrod was a very generous sized portion, nicely caramelized and served with lemon and butter and perfectly done.\nWhen I was given the option of fries or baked potato or rice I asked if there were a green option and broccoli was offered, it was done perfectly as well and the amount was easily enough for two to share.\nMy dinner came with a salad, which happily WAS NOT from a bag-o-lettuce, but rather freshly cut romaine, a cuke slice or two, carrot shreds and tomato, and it was accompanied by a store bought dinner roll and butter.\n\nThe service was quite good, although the waitress appeared to be a bit over-extended, but that's a management issue, not the server's fault.\n\nHappily they are in the Cleveland Entertainment book, and as I had the coupon sitting on the table during the meal, the waitress took the value off of the ticket before it was even presented!\nI'm all for efficiency, especially when it affects how quickly I can get out of a restaurant.\n\nThat move garnered the fifth star!\n\nWe both stated that we will go back in a heartbeat!","useful":2,"funny":0,"cool":1,"type":"review"}
{"review_id":"6YC4o9yLc25DK8c6soOlaw","user_id":"iSdSNh1hjdE33LOwrFnFrg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2015-07-27","text":"If you like fried food and laid back, then this is the place for you.  Nothing that will blow your mind, but the people are great, the restaurant is laid back and casual and the food, while not very creative, is cooked well, presented well and the prices are not ridiculous.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"T5Xa-KKFqgXdbFnATZA4gg","user_id":"catpxxLS6OF5cfjxLvpAbA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":5,"date":"2014-02-24","text":"THE CLASSIC BURGER IS AMAZING.  It's definitely a top ten burger. The fries are good too.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"JYyKOtLznozAlT8P1Foaow","user_id":"Zmp1Q6Ul9VH3zL02Z5ls_A","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":2,"date":"2013-03-16","text":"I was not impressed with how gross this place is - I wasn't sure I wanted to order anything. The food was not outstanding. I think I would go across the street to the Tavern!!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"4FnZR30PtlEb1Ifi7S65bg","user_id":"vzKgTUCV5Pz0gldaeM5j3g","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2015-09-05","text":"Okay bar food. Nice bar setting but food is average, service is average and in general doesn't really art itself apart in anything. Would I go there again? Probably if I'm in the area. Would I go out of my way to go there or make note of it to others? Probably not vegetable soup was good though and wings were fairly priced.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"6GBjCBVtPGsnQ67neAAkjw","user_id":"i8hCMZN-0bHENsHZKHpC-g","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2011-05-25","text":"Was boozin and cruisin with my canine comrade. Went all the way out to Hudson via Brecksville\/82. Looking for anything to Yelp. Nothing. Not even in the strip mall I used to hit in Hudson on my dry cleaning route back in the day. There was a deli, but it opened at fucking 11! Who even wants to go to a deli after 11? Weak. Breezed through Peninsula. Winking Lizard? Bah. Ended up backtracking through Brecksville and I remembered an old friend. London Pickle Works! Was it still there some four years after I stopped in while house shopping? Yup. Incidentally, investing in a condo down there probably would have made more sense than buying a house in Lakewood. Live and learn.\n\nCozied up to the bar and ordered a Killians, plus cheesesteak to go(for pooch). Like the Unicorn, food was amazingly done before I could chug my brew. I could get used to this kind of service. The bar was all old men. Matt, I don't know how you do it. They were watching Fox news for chrissakes!! Total was eight dollars! Holy shit. I dropped a three dollar tip on that barmaid's ass. How could I not? A real meal at fast food prices, at fast food speed, served by someone not under house arrest with work privileges. Busted open the styro box. Big sandwich with mushrooms, onions, cheez and beef sliced so thin I swear it was a Steak'um. I never ate those as a kid, but I remember one time my friend had one in his bedroom where we were playing NES. He didn't want it, so we threw it all around the room. Fries were awesome. Also got a pickle. That's eight dollars with the beer, just to recap. Great value, nice location, old men. I won't wait four more years to come back.","useful":7,"funny":7,"cool":6,"type":"review"}
{"review_id":"CdBHQT3WuYuQf-VQ1Um8tQ","user_id":"OdTvOw8NKzaCcsj_dnRZSQ","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2013-02-12","text":"Alright, i was about to give it 3 stars bc it's not that great, but it's super cheap... wait, but it's kinda filthy too, so umm, 3, final answer.  The food is edible, but a bum could afford to eat here, so i mean, it sure beats eating out of a dumpster.  Cheap brews, cheaper food.  I think the building is made out of iron, my phone practically turns off whenever I go inside.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"FFTN8Y1U9G2F_p1dQnxO7A","user_id":"W4cfK8SxPloWtIXl3JST2g","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2016-05-11","text":"Okay, so it is a bar with an old fashioned family restaurant attached. We were there almost 2 hours for the Tuesday night burger special. They need more staff. The table was a little sticky. However, the food was delicious. The French fries were nice and crispy, and the Half pound burger didn't taste like a pre-made frozen patty. Our total bill was $15.30 for 2 meals and 2 Cokes. We'll definitely go back.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"VlDz03s9VyODcVi1S9-Yfw","user_id":"n5P4Cw7F1pCYwVutSTqUPg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2016-05-04","text":"3 stars is fair for this pub. \n\nThe food is good and well priced for a bar. \n\nTuesday has $5 burgers and chicken sandwiches. \n\nThe pecan pie is good for dessert. \n\nI got the chicken dinner, it came with a 6 oz chicken, broccoli, steamed potatoes, salad, and roll. It was ok. I'd stick with the burgers though. The salad was fresh. \n\nTheir fries are really good.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"HbnWR7vaXD5FLCcrrMAGhg","user_id":"ub50UE95-gu7yIoed1zssA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":1,"date":"2016-01-23","text":"Unmmmm, no. It's a bar with tables in the next room. It's feels grungy. Service was good, food, not so much. Praying I don't get sick!\nEverything tasted like it came from a can! Nothing fresh or tasty about it. \nGuess who won't be back?","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"YGfi1F_Fuc_OyemfqQFspg","user_id":"57w8gLY3f7OwGmWNtUIFIA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":1,"date":"2016-03-17","text":"Have dined in twice now and today was take out for corned beef sandwich. I don't know why I keep thinking this place is going to change. Food is at best \"ok\". The inside is a dive needs some serious updating. This would be ok if this place was a hidden dive bar with amazing food- not the case.\nToday's lunch- puke. Dry corned beef, probably the worst I ever have had. \nLession learned never returning.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"cTNeflcioISILyhQpt0HDA","user_id":"RlpkcJqctkKXl-LO1IAtig","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2016-08-01","text":"This place is very dark and dingy on the inside. It is the cliche of townie bar. The food was just okay but the drinks were super cheap and the service was good.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"FM3Uo0F_2BHp1JdxR5nqvQ","user_id":"m5iFZbW5hSNPNplx-vGkyA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2013-06-12","text":"This small tavern, has great burgers and the best fries within 100 miles!  It's simple, unpretentious, and the folks are mellow and ready to accommodate their customers.  I understand they added music on the weekend and will surely check it out on the weekend.","useful":1,"funny":0,"cool":1,"type":"review"}
{"review_id":"Pqe0NlNUcxzEnUXALZviuA","user_id":"1-xPzJk_ijBvY2J8Re1DIQ","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":3,"date":"2011-04-01","text":"The food is typical.  Wait how much was my meal... Then that food is awesome!  Very friendly atmosphere.  Prompt service.  Diner\/Bar type place with no particular theme.  (Sorry if there is an attempted theme.  I didn't see it.)  Not a foodie spot or hidden gem, but something about this place just feels... nice.\n\nSide note: My apologies for my complete unintentional dine and dash.  Wrong card.  Also sorry to the other guest whose bill I signed for them.","useful":0,"funny":2,"cool":0,"type":"review"}
{"review_id":"vAuh2cggRJI1ZUqiZDEjHQ","user_id":"oPQAJEiJnRrD0Km5RlKmtw","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":5,"date":"2016-08-14","text":"There'a a reason that everyone loves this place; it's your typical neighborhood bar in the evening (it's typically middle-aged locals, not a rowdy crowd) but it's also a great place to grab a nice meal with your family during the day. They also have a fish fry every Friday during Lent. The food is really good for bar food, and it's very reasonably priced. Obviously, this is not five star fine dining, but if you're looking for a cheap and inviting place to hang out with friends and family, this is a great place, and the food is great for what it is.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"sKStdKdvO5nIn1ZN0OC-cg","user_id":"bZBPVRIGQZ0WXRYLtYXbYQ","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":2,"date":"2013-04-01","text":"Not particularly good. Bathroom is nasty. Food decent. Terrible cell phone signal and no WiFi. Probably won't return.","useful":2,"funny":1,"cool":1,"type":"review"}
{"review_id":"uVdnYmlXio7BqtfmZZU-0w","user_id":"fflaErtSIUWvHe3q0I3JAA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":2,"date":"2013-01-23","text":"Went here last Friday for dinner very disappointed!  Waited for ever for someone to tell us to seat ourselves and then waited forever for the waitress to come over it seemed they were very busy gossiping at the counter.  Food was so-so nothing special the salads good use cheese served very plain.  Better restaurants nearby.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"f0l_4MrqYjVCOZq_PowquQ","user_id":"BRO98wNeY2Q_BZX8G-iVvg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2012-05-01","text":"I can't give this palce 5 stars because hell, its just not a 5 star place.  But it's the Pickle!  If ever in Brecksville stop over at the neighborhood bar for cheap, quality food (you get what you pay for though), a typical old bar atmosphere, free popcorn, and sit in chairs that I swear haven't changed since I was 5.  The place is awesome, I'm there every weekend.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"QfnIyQ5wYk2NDWSLYkSbgQ","user_id":"qn7SAaO9Jwl2ls5c9Og2yA","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":4,"date":"2012-03-01","text":"Great prices.   Good food. Typical fare: burgers chicken, fish, etc  Really friendly and eccentric staff. This place is a keeper.   Try the hot pickle. I buy them and use them in bloody marys.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"QVS_4D3lLpilcljTSzKtcw","user_id":"7phnWalwWR0LcV-4xGGFgg","business_id":"4P-vTvE6cncJyUyLh73pxw","stars":2,"date":"2015-11-21","text":"Neighborhood bar, with the friendliness that comes with it.  Also the quality of food you would expect. Family friendly.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"-K5z7DzXHJgEC1tsTLfFeA","user_id":"C0jquh-km5UnawqDqSQpBw","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":3,"date":"2009-09-15","text":"We came here for dinner to celebrate my friends Birthday.  The restaurant itself is beautiful and the service is incredible but for some reason I felt like something was missing.  The food was decent but way over priced.  I guess for the money we paid I was expecting something else.  Overall it was a nice evening and my friend had fun so thats all that matters right?","useful":2,"funny":0,"cool":0,"type":"review"}
{"review_id":"2tjghSImOPf4A9L4zhByRQ","user_id":"cPifBB7Qbjs9PntPGOY9iQ","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":3,"date":"2010-11-25","text":"Ah, Khotan... I knew you when (SIGH) you were something different.... a perfect blend of Asia's decor and food... and how far you have fallen since that time. While I still appreciate your service and your stunning looks, I am surprised by what has happened to your menu... sorry looking sashimi (though the uni was a standout... shouts out to Santa Barbara!!), uninspired hot foods (kung pao shrimp at $21? For real?? ).... even the drinks are sorry in comparison to what once was.... SIGH.  Perhaps this is why you are closing your doors from November 30th through January 3rd (Seriously? During one of the busiest times of the year in Vegas!?) At least you still have your Treasure Island pirate show, which will always be a sight to behold. Perhaps you should visit what you once were (read: Social House at Crystals) and reclaim your glorious days. Until then, I will continue to hold onto hope that you will find your spotlight (or at least a better menu) once again.","useful":1,"funny":1,"cool":1,"type":"review"}
{"review_id":"fCVQlHk6x7-S2FWWMbOWpA","user_id":"pgTz-Ds6WvS8qFOsRekG9A","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2011-01-13","text":"Khotan sucks as a place to eat. The girls and I went to this place for \"Dinner\" but really all we got was appetizers. We went during happy hour so it was suppose to be cheaper, but it don't mean the size is bigger. I ordered some spicy tuna and it was $7 for like a tiny portion that didn't do anything for me at all. The roll were so tiny it was about the size of a quarter and I got four of those. BOO times 2. The only reason this place got two stars out of me was the bartender. They both were entertaining and he gave us some drinks for free. Atmosphere is really not impressive either.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"N42b2u6YSL5iEjN6NnrKeQ","user_id":"GDeoUHALgyqK13ewN92Jnw","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":4,"date":"2010-09-06","text":"My boyfriend and I decided to go resturant hunting on our visit in LV for our 1 year anniversary..we didnt have a spot in mind but on our many, many, many walks on the strip we found Khotan. \n\nSo I decided to call and make a reservation since I didnt know whether it was a forsure spot we would get in for dinner. *WHICH I DO RECOMMEND, BTW!* We got there and were greeted and waited in the longue\/bar area..it was def cute, we were soon taken to our seats in the patio area (which i also do recommend esp if you come around the 9 o' clock time frame for the pirates show.) OMG, when were going up there are beautiful gold deposit boxes all around then you hit the patio\/seating area and you get a great view of the strip AND the pirate show..feels  like the fireworks are going to hit you haha.\n\nThe food was great, me and my bf def recommend the chicken lollipops for a appetizer (get two bc i could finish that whole plate if i didnt have to share with my bf HAHAHA). You def wont regret it, I ordered the Khotan Beef plate and it was actually good! I wish it did have a little more but I was full forsure. My boyfriend had the Orange chicken plate I believe and he enjoyed that plate as well although he did wish he had more food on there...just b\/c hes def a fattie. haha\n\nOverall, great place for some pan Asian food, GREAT SERVICE btw!, great views, free show of the pirate show w\/o the bussling of the crowds, patio seating is great and def a great overall resturant in vegas.","useful":2,"funny":1,"cool":2,"type":"review"}
{"review_id":"3r40NTxUZyjPI26ftFaHaw","user_id":"d1sLYlfSzHo6WCpfe-j7zg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":4,"date":"2010-07-28","text":"***for lounge only****\n\nMaybe I like this place only because my friend and I stumbled upon this place during happy hour.  Oh the two best words ever.  We ordered from the cocktail happy hour and I got some cranberry concoction (don't remember the name) and my friend had the asian pear.  I liked mine since it's tart as I like it but my friend didn't care for it. She did love her asian pear though since it was pretty sweet.  We were going to have dinner so we didn't splurge on appetizers but the couple next to us took advantage of the happy hour prices.  I took a peek and it looked like it was good since they ate every bite of their sushi rolls.  Bartender was really nice as well.  Noted, maybe on a weekend this place is poppin' but I enjoyed the quietness in the busy Vegas atmosphere on a Thursday night.","useful":0,"funny":0,"cool":1,"type":"review"}
{"review_id":"sSuy_QaLPKX99kSGy1QwHA","user_id":"GABWrw5Et9jubriKwMUDbw","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":4,"date":"2011-03-29","text":"I love the decor and vibe of Khotan. A little hard to find at first but once you enter, it's worth the search. I really liked the safe deposit boxes in the entryway - made for some cute pictures. \nFood: Yum! I think it *may* be hit or miss based on reading other reviews but we chose wisely. Here's what I liked:\nSpicy tuna roll - just enough spice, quality fish\nCurry noodles - love the curry they used, definitely singaporean. big shrimps. \nGinger chicken with broccoli - a lighter option with clean flavors.\nService: Great! Our sever recommended his favorite drinks and was helpful answering questions about the food.\nThis would be a great date spot. I'll be back to enjoy the atmosphere :)","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"tebBZw0NttA_4xjV10k1xA","user_id":"4ZecK0IVM-5_E5-wczXqZg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2009-10-03","text":"Worst sushi rolls ever -- the shape and size of a box of Tic Tacs with chewy rice and a rectangular layer of raw fish on the top. Bland, difficult to eat. We were hoping it was the same chef as Social House (restaurant at what is now Khotan's spot) because there was a jalapeno yellowtail sashimi on the menu (like the amazing one we'd had at Social House two years ago). The jalapeno yellowtail sashimi was actually excellent. The rest of the meal was totally downhill. When we started walking upstairs to get our table, the maitre 'd called out, \"Watch your step because if you fall, I'd have to laugh at you.\"\nSo, they can't make sushi and they have some clueless staffers too. Don't waste your time or if you insist on going, try the hot foods versus the sushi rolls.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"ud02HHp2XgjV8d4xBm4eIw","user_id":"pRAPaBJ-MyO70-aVAX36Mg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2009-11-20","text":"My girlfriend and I stayed at TI and we were looking for an easy dinner one night, so we decided to stroll into Khotan.  Meh...\n\nI wouldn't say the food was bad, but it wasn't good.  I think the best word to describe it would be: amateurish.  It would be hard to believe that they had real sushi chefs in the kitchen, or that they used high quality fish.  Some of the fish didn't taste like anything!  No taste!\n\nThe service was pretty good, but our waiter didn't seem to know much about fish.\n\nDon't waste your money on the Jalepeno Hamachi appetizer.  I don't know how anyone could have the nerve to charge $22 for 5 tiny pieces low grade Hamachi (if it even was Hamachi) on a chip.  The Tuna Tartare wasn't that great either...  I've had better hors d'oeuvres at weddings.\n\nThe concept of the Salmon Parmesan roll sounded good, but when eating it, the Parmesan didn't make sense.  I was in the mood for noodles, so we also ordered the Crab Lo Mein.  It was basically ramen noodles with a few pieces of tasteless crab on top.  I could've made ramen noodles and topped it with imitation crab for about $2 and it would have been just as good, or better, than their $14 dish.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"cPVGvM9haeAjMPZtbMlDOw","user_id":"lac5Nj5BOKhSJjEfT7oZxg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2010-09-02","text":"I was extremely excited to visit this restuarant since I\"d been planning my reservation there for weeks, thanks to a smart groupon buy.  I have to say our seating was amazing out on the scenic deck.  However, I do have to say, that the food was blah.  I ordered the Salt and Pepper Prawns and the waiter expressed to me that they had a few shells underneath HOWEVER the Prawns came whole, fried with shells and eyes.  I mentioned that I was expecting a few shells but couldn't eat through these,,,he said well, I told you that it came with shells and half-heartely offered to recook them.  This only after the plate had been sitting for twenty minutes.  He avoided our table like the plague as I could tell he could clearly see I was NOT eating.  AT the end he offered a free dessert but by that time it was a little too late for me.  I don't like to compare high end asian restaurant to PF CHANGs but on this night PF would win.  Try The GRand Wok in the MGM grand.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"mUPdz50uiC_kPsEH8A9_Ew","user_id":"WI5CkCRbzcUdFAU941mdYA","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":4,"date":"2011-03-17","text":"Only 4 stars because of the expense--without our $55 Groupon, our meal for two, including one large house sake, would have been over $100.\n\nHowever, even if we hadn't had the Groupon, it would have been WELL worth the money. What a find!! The decor is gorgeous, we were waited on by two attentive garcons (sat at the sushi bar so chatted with the sushi chefs as well), and the menu is extremely creative and--most importantly--DELICIOUS. \n\nOur waiter recommended the yellowtail appetizer with tempura jalepenos in a light, yummy sauce and WOW was he right. We both \"mm'd\" through our whole meal, starting right from the tasty beginning. \n\nEvery piece of sushi (we got the large maki for dinner so we received about 20 pieces of sushi) was fresh, generous and absolutely fantastic. \n\nBy the time we finished our large dinner order we were almost full, but definitely not ready to stop eating! We each ordered another round of nigiri--my boyfriend got tuna and I got salmon, YUM!\n\nWhat a hidden gem...thanks to Groupon for helping us find this one! We will DEFINITELY be returning next time we're in Vegas.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"5amEF7AHj87DXTEvblEw8Q","user_id":"YSFhFKYaotk5rE3VECcQxg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2010-04-26","text":"Sushi was very average and very expensive with no wow factor. Tasted just \"bleh\". Miso soup was very salty and ginger salad was made from a lot of weird lettuce that was not cut small and difficult to eat. Took a long time to get the salad. We asked to sit on the balcony to watch the show and they gave us a table at the backside so we couldn't see. Service was barely ok and kept making excuses why it was taking so long.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"XQaK1CiSsJdsxJP5uhRccg","user_id":"AbC6lu_5RrMgslQeocvzRg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":1,"date":"2015-02-13","text":"A Superficial place in Treasure Island, trying too hard to be upscale, however, the food quality does not meet its price tag, which is way overly priced.  Fast food quality, price higher than TAO, go figure. Staff also try too hard and gets annoying. No wonder their business is not good at all. TI is not an upscale place to visit either...","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"D0JqU2amlbvcDdsB1wQuHw","user_id":"PPCFx8NTgsELmNogzDjL0g","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":4,"date":"2010-05-01","text":"I can't say from my experience that I understand the mediocre reviews for Khotan. My wife and I thoroughly enjoyed our meal. We didn't have the sushi and stuck to mainstream pekinese type dishes; lettuce wraps, edamame (ok, they're Japaneze), lobster curry and sweet&sour chicken, all of which were fresh and tasty. \n\nI suspect this place may suffer from an expectations standpoint. It is not that expensive, we paid approaching twice the price at Jasmine two nights before for a similar quality meal. I am going to brutally honest here and suggest what is expensive to a TI guest is not the same to a Bellagio one ( we are neither by the way). \n\nGive this place a try. We really liked it.","useful":2,"funny":0,"cool":1,"type":"review"}
{"review_id":"U_P13SRuczdXTYD1zgu96Q","user_id":"gq8dZgJConBUANpSFzKKjg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":3,"date":"2011-01-22","text":"Like several other reviewers, I went to Khotan because a friend had a Groupon and we of course waited until the last minute to use it.\n\nI checked out the menu before going and was really scared.  It really looked like a Panda Express menu with such exotic choices as sweet and sour chicken, orange chicken, and beef and broccoli.  Authentic, Khotan is not. But, hey, it's food and we had a coupon.\n\nThe decor inside is really wonderful, with really interesting jade statues, ivory carvings, and a wall of gold, vault-like boxes. A++ for effort there.\n\nWe were seated outside and it was  a nice night.  But, seriously, that Sirens show is craptastic and if you're not a fan, sit inside.\n\nWe ordered Khotan lobster, chicken lo mein, brown rice, and a tempura platter.  The sauce in the Khotan lobster is great, but, gasp, it's $36. The chicken lo mein was \"eh,\" very boring and the chicken was slightly overcooked. The tempura platter was delicious but anything fried always is.  I'm conflicted because I generally liked the execution, food, and service, but it was such a boring menu I'd probably never go back.  If you want expensive Panda Express-esque food with a strip view, however, this is your place.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"Ulb1lFkd2EjXiXk_8lIsDQ","user_id":"wDdh7cLIFK08KtJhj5q9uA","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2010-02-02","text":"We stumbled upon khotan by pure laziness...We were watching the TI show (wow...not kid friendly anymore) and gambled a little before we started getting some hunger pangs.  So we wandered a little bit and saw the downstairs opening for this place.  We thought it was a small casual place and had no idea it was considered upscale dining.\n\nThe host greeted us then talked into his ear radio....He then escorted us to the elevator and sent us up.  We were then greeted by another host and seated in the bar area since it was a quiet sunday night.  We just needed a few bites to eat so we could make our flight without starving.\n\nStarted off w. some edamame (the norm, nothing crazy) then we shared chicken lollipops (not bad), kobe sliders (looked dry but were actually moist), gai lan side dish (cant go wrong w\/ veggies) and a noodle dish (don't remember which but it was dry dry dry and super chewy\/tough rice noodles...terrible).\n\nIt was just a spot we ended up at due to convenience of it's location...right in front of us as we were about to give up looking...\n\nFood was good but not memorable. (well except the super awful noodle dish)","useful":1,"funny":0,"cool":1,"type":"review"}
{"review_id":"3oy99xSSdewIQxS3Vc4M6A","user_id":"c3oKqsoDC9SDjJjP1LMARA","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":3,"date":"2011-03-18","text":"The restaurant was pretty slick, great atmosphere and a really cool patio. If you happen to go for dinner the pirate show is pretty cool since you are watching it from the back side of the boats. The Edamame was really buttery and apps were spot on. The drinks were great, and my ginger mojito was really refreshing after a long day on my feet. \n\nThe reason this wasn't a 4 star was because my diner was rather salty and not much better than something I would get at my local Chinese take out place. The food was so so, but the drinks, app and atmosphere were great.  \n\nWorth a visit and they frequently have Groupons and happy hour specials.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"keG92lC9WWLPvRn1Yne8Sg","user_id":"-ObHxZTruZ2YGkoamYFhyQ","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2010-08-16","text":"We used a Groupon to try out this restaurant in TI.  We sat at a table on the patio to watch the 8pm Sirens show.  \n\nPros:\n- nice patio with misters and adequate seating.  Good location to see the show (even if the show is GOD AWFUL- but I won't rate this place according to the show.  My eyes were bleeding after watching it.)\n- decent variety of food selections and full bar\n- decor and ambience were pretty nice\n\nCons:\n- food was overpriced for the quality.  I had the Teriyaki chicken, which was dry.  California Roll appetizer was dry and fell apart.  The lettuce wraps were decent appetizers, as was the tempura platter.  We ordered a lot of food and were really underwhelmed.  \n- service was uninspired and our waitress looked really annoyed to have to walk to our table, which was located a bit out of the way.  She disappeared for a bit while we ate and my husband had to go to the kitchen to get more soy sauce.  We eventually had to call out the Mgr to ask for service, and things got better after that.  He was very apologetic and checked in to make sure things were OK.  \n\nI think if we hadn't had the Groupon, we would have not come here.  Without the Groupon, we would have spent the $200 elsewhere and received much better quality food and service.  I suppose it might be worth it to come and try the lounge area during happy hour.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"NkJM5LxehFqgsIB7LPBiCg","user_id":"kEH9rD6yJbGYcvp9_2RKrQ","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":3,"date":"2011-01-08","text":"I ate at Khotan tonight with my husband, sister-in-law and her husband. We were there to use our Groupons before they expired.The service was really good. So was the lighting. We ordered the sliders, Tom Yum with chicken and the crispy asparagus to start. The sliders were pretty darn tasty with a side of pickled ginger that our server recommended. The Tom Yum was really good too. The asparagus came out ice cold. They brought us another one, but it still wasn't great hot. The coating is way too thick. We all agreed that they use Rice Krispies for the \"fry.\"\n\nFor dinner, we ordered the Pad Thai (awesome), Khotan beef (decent), and crispy walnut shrimp. All of us like walnut shrimp from Ping Pang Pong and China Mama. We were expecting it to be hot. It was cold. Apparently, that's the way they serve this dish - fried cold shrimp. Once we knew, it wasn't that bad on the bed of vinegary salad. Just wasn't what we were expecting.\n\nOur dessert of mini-cupcakes was comped. The worst cupcakes I've ever had. Three cupcakes - mango, coconut and chocolate, each with their own sauce. I really, really wanted to like them. They didn't taste fresh and were too cold. The cake wasn't fluffy and was really dense. \n\nThe restaurant is beautiful. Worth a try. Don't expect miracles.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"vbuArRtzxYv6c359wj07mA","user_id":"24hyqUROHABynDLYTUpqkQ","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2010-01-26","text":"This place is weird.  So we were greeted by the hostess in front who looked like she was wearing butt pads.  No skinny Cambodian-looking girl would have an ass that sticks out ten inches from her back unless she stuck a basketball in there, seriously.  Then she told us to go upstairs because that's where the real restaurant is at and we were again greeted by another Asian hostess. While walking upstairs, you would feel like you're in a bank's safe box room because seriously, that's what it looks like, no joke.  Fun to play with, but weird.  Am I missing some sort of cultural significance here? \n\nThe place is dark with small tables, chairs and booths.  It took them ten minutes to hand us the menus after being seated which I thought was incredibly appalling because I'm sure they didn't forget about us.  They have candles on the tables which made it kinda uncomfortable because it seemed too romantic for our own goods (We were hungry and randomly walked into this place).  I ain't gonna lie, the food was good!  We ordered some noodles which tasted like mixed flavors of Chinese and Italian.  Surprise, surprise, it came in a tiny portion that can easily be confused as an appetizer.  WTF mang.  There were just too many selections on the menu (sarcasm) so I ordered an eye roll.  For more than a dub, it's not worth it.  But compared to other rolls I've had at other sushi places, this roll melted in my mouth with just the right amount of flavor, MmmM.  As long as its good, I like it.  \n\nI liked how our waiter came back to refill my friend's drink a couple times without being asked.  I like attentiveness.  I like staffs who pretends to be genuine as good as they're faking it.  Having missed our menus for the first ten minutes, the service is above average. \n\nEven if money grew on my orange tree, I wouldn't come here again though.","useful":0,"funny":3,"cool":0,"type":"review"}
{"review_id":"4RN8VIj5iY8Jrx3UxTzEjw","user_id":"iUHPgpGXuJ-e8jXEhvK-AA","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":3,"date":"2010-11-23","text":"I'll echo what others have said.  The service was poor.  This is a $6 million upfit and it's gorgeous.  The food is good, but not spectacular like the atmosphere.\n\nLots of potential here in the front and back of house.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"H8SsK_SsLZSh6XycXxlINw","user_id":"jIjC8F9Xiz7R5M-krH6OGg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":1,"date":"2009-12-04","text":"What a waste of time and money.  We had dinner thinking that the chef from Social House was still there but I guess I should have read the other reviews posted by yelpers.  I guess if I had to describe the restaurant it would by con-fusion...horrible creations that make you think twice about eating there (salmon parmesan roll, crab lo mein Alfredo, wtf?).  Terribly expensive and it seemed that the staff didn't care too much about what was going on around them.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"ws3sKm5MrtZEDEsjCgOAJg","user_id":"HvquD8QalzpQlbXK-1KYlQ","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2011-04-22","text":"Not worth the money. Bad drinks and equally bad overpriced food. The pay roll was bland and possibly the worst I've ever had. It made the $35 roll taste even worse. The mongolian beef is better at P F Changs.Service was good. Decor was very nice. It takes alot  for me to say these things about any place. Good luck.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"6ye4tUGnj1lmhm_kvK_sPg","user_id":"3etKdarpGqQYpoLENXKt6A","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":4,"date":"2011-03-17","text":"Recently ate at Khotan. The food was quite good. I had the cashew chicken and my wife had sweet and sour chicken. While somewhat expensive, and the service a bit slow, it was a good experience overall especially with the Groupon discount saving us $25.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"maELoO1vbOSzztlEgCdDWQ","user_id":"53bZ_EsXH71L7iFs5MP9_w","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2010-01-06","text":"Much MUCH better as Social House.  What the hell was TI thinking?  SH was more Japanese influenced, I would say Khotan is more Chinese influenced, with a Japanese pricetag.  \n\nGrub:\n*Jalapeno Hamachi, not as buttery & fresh as I'm used to, soy overpowered, I liked the battered jalapeno slices, great texture, $22\n*Rainbow Roll, snow crab & fish were not fresh, $18\n*Broccoli Beef, liked the Broccoli Rabe aspect, the beef was eh, $24\n*Gai Lan, cooked nicely, & not too greasy, $6\n*Crab Lo Mein Alfredo, really strange, like the powdered packet in Hamburger Helper, but oddly comforting, $14\n\nThis place is pretty pathetic, but they serve a mean cocktail & boast a great alfresco dining option.","useful":2,"funny":0,"cool":0,"type":"review"}
{"review_id":"N6sCtNlRnXsvWX8TwNDIUg","user_id":"NoEI3raAUBkZKZMczZVlaQ","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2010-03-15","text":"Was craving sushi after walking around the outdoor mall at Treasure Island. Just happened to come across this place. The food wasn't bad but it wasn't necessarily good either. Decor is nice, service is average, the bartender was cool though. For the price they charge I would pass on this place. I know it's Vegas but there's some standards you would expect based on the price and the food just didn't meet the standards in my opinion.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"-PPFXSSsh-yi4LpBzr2MWQ","user_id":"PpTSDy5cQM25rqcI19yg0w","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":1,"date":"2012-10-16","text":"Khotan is Closed and \"Senor Froggy\" resturant.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"ilVcRwYNopvGus0yR_2zZw","user_id":"HgmpXWF_p1WfG_Kq90jUkg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2011-03-09","text":"I came here back when it was social house, and now Khotan. I tell you it's like night and day. And I don't mean that in a good way. While the decor hasn't really changed much. The menu sure has and not for the better. My experience here while being social house was so wonderful. I figured regardless of the name changing I'd give it a shot. Boy was I wrong. Like I mentioned before the decor is still unique. Dim, sheik, very Asian like of course. But wait, they use to have a dj in the lounge area. Gone, go figure. And the waitresses from what I remember were a lot nicer. Anyway. I ordered a few sushi pieces, with some chicken like kabobs. I believe a salad. Had a few beers. Sushi was very Mediocre. Chicken was dry. Salad was salad. Can't really remember anything memorable from my meal. Aside from the overpriced food. A big disappointment. I doubt I'll be coming here again. Only reason I'm even giving this place 2 stars is because it was once social house. Anyway if over priced wanna be asian food is your gig. Along with half ass service. Be my guest.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"4zVgAV6cGM5i0RWzBh7n5g","user_id":"YLgDEG9vFIiHo5e3K_g0hQ","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2011-05-21","text":"Mediocre food. 50$ for one person. I could have had better food at Panda Express. The orange peel chicken was cold and lacking flavor. The veggies in the dish tasted like they weren't washed before being cooked. Only good thing about this place is the atmosphere, it is the only reason I didn't give it 1 star.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"Adf4hvwmXzsAGmQKAMMYpA","user_id":"WOGd8Xxq0ya99vp8YWmA8g","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":5,"date":"2010-07-21","text":"You can IGNORE all the complaints regarding price as this restaurant (formerly Social House, and formerly Khotan Pan-Asian Cuisine) now goes by the name of Khotan Asian Bistro and has a NEW menu with lower prices.\n\nMore importantly, there a few restaurants in Las Vegas that offer a more impressive atmosphere.  Anyone comparing it to \"Panda Express\" or even \"PF Changs\" is simply not doing this place justice.  The modern and sleek decor hasn't changed too much from the days it was Social House except for the fact they have added some stunning jade and ivory sculptures on display.\n\nMost importantly, the food presentation, taste and service are well beyond expectations for a \"reasonably\" priced restaurant on the Las Vegas Strip.\n\nCan you get Asian food as good or better at a lower price down the street (Spring Mountain) in Las Vegas Chinatown?  Yes, of course, but no where near the same dining experience in terms of location, seating (indoor\/outdoor), ambiance, and cool vibe.\n\nI would challenge some of those that previously rated this place less than 4 to give it another try.  Unless you are a complete foodie-snob and\/or have no clue what a \"normal\" price is for a Las Vegas Strip restaurant, it will be difficult to rate this dining experience lower than a 4.  Of course, that's IMHO.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"-VrIBSpMzFxdVeP04eMXZw","user_id":"OuRxTH-PPuRzpmtWXkOavg","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2011-06-30","text":"We went there to celebrate our anniversary. When we called to book a reservation, they asked if it was for a special occasion. When we got there, no one congratulated us. No one seemed to care that we were even there. There were lots of staff walking around, but most of them seemed to be chatting amongst themselves. The food was ok, but not worth the $67 bill for 2 dishes and one drink. The jade exhibit was amazing and the atmosphere was good. It could have been better. We were interested in dessert, but got the impression that there was none, until we were asked after we finished dinner. I would have made room if I knew there was dessert.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"FTx10AG-Ipaldnb3A8ZMcg","user_id":"6gZBMMTC_47cDL_LDkr3ng","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":3,"date":"2009-09-16","text":"Came here for a friend's birthday dinner. It has a cool atmosphere, but it's super expensive and the food is so-so for the price you pay. It's also super dark, so it's hard to read the menus. This is probably to hide that you're paying $45 for a few pieces of steak. \n\nIf you're here at the right time, Treasure Island's pirate show will play right outside your window, so you can listen to the cannons and fireworks go off while you're eating a romantic dinner. That could be a good or bad thing depending on your personality.","useful":2,"funny":0,"cool":0,"type":"review"}
{"review_id":"AZJx5c1QV8rKDTEL6-GTng","user_id":"cUZw26_XQSpwX3gd9GVKtA","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":4,"date":"2010-08-13","text":"While looking for a restaurant on the strip that had excellent decor and a romantic atmosphere, but at the same time a reasonable price, i found Khotan.\nThe service was good, our waiter was very social and always kept our drinks filled. I tried out the orange peel beef and my girlfriend tried out the Khotan beef both were very delicious dishes, but me being a fat ass was still hungry after since there isn't very much in the plate.\n\nwhat i suggest: \n1. Eat out in the patio if you are going to be there at nightfall, Khotan is right above the pirate show at T.I.\n\n2. Chicken lollipops! really good appetizer","useful":1,"funny":1,"cool":1,"type":"review"}
{"review_id":"yfF0bUmR65iOGw0QefGSPA","user_id":"OpAfXeNL4kJA59PoUFU7ew","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":4,"date":"2010-11-02","text":"My four stars are for the lounge area and the food.  The service in the dining area was lame.\n\nThe lounge was great.  During happy hour (5-7PM) there are drink and app specials. And since ISLA was packed to the gills, my fella and I decided to check out Khotan.  The barkeep was friendly and chatted us up while we sat and watched an NBA game. \n\nWe were so pleased with the service and food (spicy tuna roll -- YUM) that we decided to come back a couple hours later for dinner.\n\nThe dining area is upstairs.  Getting up there is quite a sight - floor to ceiling gold drawers. Pretty impressive.  Once seated (inside) we quickly realized we should have sat on the patio.  The inside of the restaurant was dark.  Not mood-making-romantic dark.  More like push-that-candle-here-so-I-can-read-the-menu dark. Oh well.\n\nWe ordered a couple entrees (pad thai and singapore style noodles) and a Tom Yum soup.  The soup was super tasty and chocked full of amazingly tender chicken.  My one gripe about the soup...there were pieces of fried scallion (or something...I couldn't really see what it was) that was really fiberous and unpleasant to eat.  I ended up picking it out of my soup.\n\nThe pad thai was to die for. Super tasty and a really great portion.  I did raise an eyebrow at the price ($15) - but hey, it's Vegas baby.  My fella loved the singapore style noodles.  He would have licked the plate clean if he wasn't so classy.\n\nWe enjoyed a two-for-one cocktail with our complimentary voucher from Treasure Island and both opted for the ginger mojito. (Give me anything with Canton in it and I'm set. Yum.) \n\nSo - let's talk about the service. The servers were polite and great when we saw them.  We had four different servers at one point and before any of them could get to our table to take our order, the barkeep came by since we had been sitting (unattended to) for about twenty minutes. This could have definitely had to do with the fact that for a while we were the only ones inside the dining area, but the servers never acknowledged the crap service.  A simple, \"Sorry 'bout the wait\" would have sufficed.  Oh well.\n\nGood thing the food is so good. I'm dreamin about that pad thai. Mmmmm...","useful":1,"funny":0,"cool":1,"type":"review"}
{"review_id":"Uw24JCOsOdkSUqq6EPogBw","user_id":"F75cB0AgEhc-mtM18B8EFw","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":1,"date":"2009-11-30","text":"This place was really good when it was Social House, now its just an expensive place to get sub-par food.  The place reeks like Ed Hardy perfume (below the restaraunt).  The service was ok, but the food was over priced and not up to Vegas quality standards.  I would definietly try somewhere else and not waste my money here again.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"HTolWbNJUULt5u_bWne1IQ","user_id":"E5glLZ1mCo10-zqq3Bj13w","business_id":"4uiijOUDzc-DeIb2XcKW_A","stars":2,"date":"2010-02-22","text":"The best description I can give about this restaurant is that it is the Panda Express of asian food and not worth the price.\n\nFor appetizer we had the crispy asparagus. It was just japanese crackers deepfried around asparagus. Too weird of a texture but okay to eat. Only 6 sticks. So to me, 6 asparagus heads is not worth that price.\n\nI got the lobster curry. Again, for the price, it was not worth. i can get thai green curry for $5.95 down the street and throw in some steamed lobster and get the same effect. \n\nhubby got korubuta pork chop. okay, but have had much better elsewhere.\n\nthe place is also really dark, to the point where you cannot read your menu. you have to put the menu an inch away from the candle on your table. lame.\n\nand the TI sirens show in the background is VERY annoying.\n\nskip this place. and TI, please don't make lame asian restaurants. it's an insult to the main demographic of your casino.","useful":1,"funny":0,"cool":0,"type":"review"}
{"review_id":"aWizkxCmuMZaeOEOuxyESw","user_id":"GZuBQoHtz39pIDsNh4EQXA","business_id":"5WoHYemsAjuK85AOcGwEJg","stars":4,"date":"2013-03-12","text":"sehr guter Service, schnell und kompetent!\ncoole Mitarbeiter","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"3Q-7kthW9izOrztE5DWUdw","user_id":"wU1V11JqKhsSptKMsnEDEg","business_id":"5WoHYemsAjuK85AOcGwEJg","stars":5,"date":"2008-09-01","text":"Lieber zu Arlt und vernnftig, gnstig alles fr den PC\nals zu ich bin doch nicht bld","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"434UggWUy1Ku5x-s1UH2og","user_id":"uZtSv8Rgi4-0BBvz4YbH9Q","business_id":"5WoHYemsAjuK85AOcGwEJg","stars":3,"date":"2012-01-29","text":"Der Arlt ist oftmals der Computerladen um die Eck, wenn man dringend etwas braucht. Doch empfiehlt es sich vorher Produkt und Preis online zu prfen, denn leider ist auch das Personal sehr schwankend in ihrer Qualitt","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"xzjuJ4Sdc8MzYVtvnYJKiQ","user_id":"FCzzkuhMrQ-pWYDA_fPmkg","business_id":"5WoHYemsAjuK85AOcGwEJg","stars":5,"date":"2011-06-08","text":"Kompetente Beratung, super Preise und kulanter Service. Gerne wieder!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"9P_dPGmnyT4neDi1cXGCOw","user_id":"LMhTti4tnUvPwON8yREDcg","business_id":"5WoHYemsAjuK85AOcGwEJg","stars":4,"date":"2008-01-08","text":"Wenn ich meine Computerteile und -zubehr nicht beim K&M hole, dann beim Arlt. Beide schenken sich recht wenig, beide sind gut. Allerdings ist Arlt etwas teurer.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"hc_6jOJ3RXw73LgbnlvjlQ","user_id":"kKXjr2cCjPMQoX0OiB6XRA","business_id":"5WoHYemsAjuK85AOcGwEJg","stars":4,"date":"2011-02-20","text":"Fast immer erste Wahl bei PC-Zubehr. Der Service ist ok und auch bei Reklamationen gabs meinerseits nie Probleme. Muss allerdings sagen das es im Bekanntenkreis schon massieve Probleme bei Garantiefllen gab, daher nur 4 Sterne.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"VIJJmHxrmfZQDeFG1DvtsQ","user_id":"V1chaUDzuPh7zLZVfnqQxA","business_id":"2cl9TETYE3CdzljPtdIbjA","stars":5,"date":"2014-11-25","text":"Best place for fries! Breakfast sandwiches! Hot Meals! I didn't realize everything is made in house from scratch!!!!!! From the hummus, salads, pasta and pasta sauce!!!! The Chicken Shawarma  sandwich is like nothing you have had before! It's juicy, fresh and huge!!! Also! Ladies it doesn't fall apart!!!! Great lunch place!!!! I personally am a fan of the falafel sandwich! They stick French fries in it for me!!! Also, the people that work there are very sweet, humble and down right good! \n\nThis place is more like family! They know everyone by name!  You walk in and instantly greeted with great service. They give you time to decide and help you customize if needed. \n\nOn several occasions I have gone into the restaurant in a rush between meetings and they are fast!!!! Which I appreciate. I have brought in a few clients with me and they never disappointed with the food. Always consistent. \n\nIf you are in the area.. Give them a try!!!! They ROCK!!!!!!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"j7JswOZSTRmtSBXQfqoC3A","user_id":"zsV1V_8FZbVMzIMVF-J3Jw","business_id":"2cl9TETYE3CdzljPtdIbjA","stars":5,"date":"2015-01-07","text":"I used to come to this joint when i worked nearby. It is family owned and the food is absolutly exquisite. They get alot of regulars and have a very loyal clientele. Friendly staff.","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"u5NBtqEHaH3gqMZMWjDRbw","user_id":"G8FR2qnN7CcdP8Q9snLhQg","business_id":"2cl9TETYE3CdzljPtdIbjA","stars":4,"date":"2013-07-31","text":"First time going here. Great food. I had a whole wheat chicken shawarma. Was really good and refreshing and filling. Will be going back in the future.","useful":1,"funny":1,"cool":1,"type":"review"}
{"review_id":"FfmIzwjKbVDDa3LpWLz3Ew","user_id":"GQNeutlSdO8OfOUWNUas0Q","business_id":"2cl9TETYE3CdzljPtdIbjA","stars":5,"date":"2016-02-09","text":"This restaurant is all about good home cooking. Wonderful spices, excellent quality and care taken. Lots of repeat customers are seen at Sami's!!\nI love their coleslaw and very fresh ingredients are used!!","useful":0,"funny":0,"cool":0,"type":"review"}
{"review_id":"rJzBClqVToyTdrV8ZnUpeg","user_id":"3iq8oDotfNXL57CbqzaaAA","business_id":"32S_SP-ZaVmQucdEY5ynlQ","stars":1,"date":"2009-05-23","text":"Just to let everyone who reads this know, I didn't actually sign a lease here, and this review is basically just to tell you why.\n\nThe \"apartments\" which are actually condos for rent, aren't very nice.  The floor plan doesn't make any sense, and the place is really old.\n\nThe biggest issue that I had here was the staff.  They were rude and complete ignorant.  The woman that showed us around (more like pointed and told us to have a look while her lazy self watched us show our selves around) looked like she had just gotten out of bed and slipped on some flip flops.  The other guy that completely ignored us while we stood at the front entrance waiting to be helped while the other woman was in the middle of a meeting with some potential renters was in a pair of ripped jeans, an abercrombie shirt and flip flops!  COMPLETELY UNPROFESSIONAL.\n\nOne of the things that suprised me the most was the fact that the woman that showed us around brought her phone with her and started texting while \"showing\" us around.  It was only like a 10 minute walk, I think the texting could wait.\n\nHappy to say, I won't be going back there ever again.","useful":8,"funny":1,"cool":1,"type":"review"}
